<!DOCTYPE HTML>
<!-- Visualize by TEMPLATED	templated.co @templatedco Released for free under the Creative Commons Attribution 3.0 license (templated.co/license) -->
<html>
	<head>
		<title>RibaFS - Est&iacute;mulo para estudar</title>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1" />

		<link rel="stylesheet" href="/assets/css/menu.css" />				
		<link rel="stylesheet" href="/assets/css/main.css" />
	</head>
<body>
<br>
<script src="/assets/js/jquery.min.js"></script>
<script>
   $(function(){
       $('#menu').load("./menu.html");
   });
</script>
<div id="menu"></div>
<!-- Final do Cabeçalho -->

<!-- Início do conteúdo-->
<meta charset="UTF-8" >
<style>
#conteudo{
	padding: 10px;
	font-family: 'Arial', Helvetica, sans-serif;
	margin: 0 auto;
	width: 800px;
	padding-bottom: 50px;
    background-color: #fff;
	color: #000;	
}
#rodape{
	margin-top: 400px;
}
</style>

<!-- Início de conteudo -->
<div id='conteudo'>
<h2 align="center" class="titulo">Est&iacute;mulo para estudar</h2>


<p>Algumas dicas para estimular seu filho ou a si mesmo a estudar.</p>

<p>Depois de uma pesquisa por alguns sites com o assunto eu elaborei estas dicas.</p>

<p>&Eacute; importante come&ccedil;ar dizendo que s&atilde;o apenas dicas e que voc&ecirc; deve usar todos os recursos ao seu alcance para conseguir este intento.</p>

<p><br />
<strong>Sinceridade &eacute; Importante</strong></p>

<p>N&atilde;o podemos querer dizer ao filho que estudar &eacute; a atividade mais prazerosa do mundo. Ele poder&aacute; at&eacute; achar isso algum dia, mas atualmente isso n&atilde;o &eacute; verdade. Precisamos ser sinceros e dizer que pelo menos no in&iacute;cio ele precisar&aacute; fazer algum sacrif&iacute;cio. Com o passar do tempo, quando ele for aprendendo e sentindo mais seguran&ccedil;a ele come&ccedil;ar&aacute; a gostar mais. Lembre que quanto mais voc&ecirc; conseguir motivar ele mais ele estudar&aacute;.</p>

<p><strong>Import&acirc;ncia de Estudar</strong></p>

<p>Fale sobre a import&acirc;ncia de estudar. Do quanto se aprende. Aprendendo mais a gente se valoriza e se torna mais &uacute;til onde quer que esteja, al&eacute;m de ajudar a melhorar sua auto estima.</p>

<p>Mas o maior objetivo de estudar, de sacrificar seu presente &eacute; o de possibilitar que seu futuro profissional e financeiro seja melhor. &Eacute; como um investimento, voc&ecirc; sacrifica algumas horas por dia do seu presente para que seu futuro seja mais confort&aacute;vel e voc&ecirc; seja algu&eacute;m que ganhar&aacute; mais facilmente dinheiro do que se n&atilde;o estudar ou estudar menos.</p>

<p>Ele precisa realmente acreditar nisso, mas precisa de sua ajuda, pois brincar &eacute; muito mais agrad&aacute;vel que estudar, especialmente nos nossos dias, quando as op&ccedil;&otilde;es s&atilde;o in&uacute;meras e maravilhosas. Ele precisa ter uma forte consci&ecirc;ncia caso contr&aacute;rio n&atilde;o conseguir&aacute;. Repetindo, ajude, acompanhe e colabore com ele para tornar menos dif&iacute;cil.</p>

<p>Procure formas agrad&aacute;veis e criativas de mostrar os assuntos do estudo para ele.</p>

<p>Veja, que quando estiver estudando e pensar assim &ldquo;eu poderia estar jogando ou assistindo filme, ou no Facebook&rdquo;. Nestes momentos rebata com &ldquo;estou investindo no meu futuro, pois quero ter um futuro melhor. Mais tarde posso fazer isso&rdquo;.</p>

<p><strong>Disciplina &eacute; Importante</strong></p>

<p>A disciplina ajuda nosso c&eacute;rebro a confiar que queremos estudar e ele ir&aacute; nos ajudar lembrando quando chegar a hora.</p>

<p><strong>Aplica&ccedil;&atilde;o Pr&aacute;tica dos Conhecimentos</strong></p>

<p>Uma dificuldade de algu&eacute;m livre e inteligente gostar de estudar &eacute; n&atilde;o ver uma aplica&ccedil;&atilde;o pr&aacute;tica em sua vida dos conhecimentos estudados. Procure mostrar que todos os conhecimentos s&atilde;o &uacute;teis e importantes na nossa vida. Claro que alguns assuntos ser&atilde;o mais importantes, mas isso no futuro quando ele escolher em que deseja trabalhar, por enquanto ele precisa estudar todas as mat&eacute;rias para que tenha um conhecimento geral e para conseguir aprova&ccedil;&atilde;o.</p>

<p><strong>Uso Racional da Internet</strong></p>

<p>Atualmente a internet &eacute; a maior fonte de pesquisas para a escola, mas ele precisa estar ciente de que apenas pesquisar e imprimir n&atilde;o o ajuda muito. Precisa pesquisar, estudar, entender e fazer o trabalho com suas palavras para que a pesquisa seja realmente &uacute;til e importante.</p>

<p><strong>Intelig&ecirc;ncia e Criatividade s&atilde;o Superiores &agrave; Memoriza&ccedil;&atilde;o</strong></p>

<p>Mostre e explique para ele que desenvolver a mem&oacute;ria &eacute; importante, usando artif&iacute;cios e t&eacute;cnicas, mas desenvolver a intelig&ecirc;ncia e a criatividade s&atilde;o ainda mais importantes e que ele deve ter sempre isso em mente.</p>

<p><strong>Organiza&ccedil;&atilde;o Ajuda</strong></p>

<p>Tenha um local definido e adequado para estudar. Mantenha seus livros, cadernos e demais materiais de estudo bem organizados em um lugar certo. Procure se isolar quando estudar. Somente use nestes momentos o celular e o computador em caso de necessidade. Tome cuidado com eles pois geralmente nos dispersam e nos fazem perder tempo.</p>

<p>Fa&ccedil;a uma agenda do que precisa estudar, anote o dia dos trabalhos e das provas. Tamb&eacute;m anote que mat&eacute;ria estar&aacute; estudando em cada dia da semana. Organize-se.</p>

<p><strong>Empenho</strong></p>

<p>Pe&ccedil;a que ele procure se empenhar bastante, que procure ficar pensando nos estudos durante o dia pois assim seu c&eacute;rebro ir&aacute; perceber que ele acha isso importante e ir&aacute; ajud&aacute;-lo quando seu filho precisar dele, do c&eacute;rebro (este deve ser seu grande parceiro).</p>

<p>Procure dormir cedo e dormir bem, para acordar cedo e disposto.</p>

<p>Procure chegar cedo ao col&eacute;gio e sentar na frente.</p>

<p>Fique atento &agrave;s aulas e sempre que n&atilde;o entender algo pergunte ao professor. Esta &eacute; uma forma de economizar tempo de estudo. Se levar uma d&uacute;vida para casa ir&aacute; gastar mais tempo de estudo. Tem mais, o professor gosta (geralmente) de alunos que perguntam e demonstram interesse.</p>

<p><strong>Acompanhamento</strong></p>

<p>&Eacute; importante o filho sentir que voc&ecirc; est&aacute; realmente interessado nos estudos dele. Para isso procure acompanhar diariamente ou com frequ&ecirc;ncia suas atividades, perguntando como est&aacute;, se est&aacute; enfrentando alguma dificuldade. Fa&ccedil;a realmente algo s&eacute;rio neste sentido.</p>

<p><strong>Exemplos</strong></p>

<p>Procure mostrar exemplos de pessoas bem sucedidas e que se empenharam para estudar e chegar onde chegaram, inclusive voc&ecirc;.</p>

<p><strong>Evite Castigos e Puni&ccedil;&otilde;es</strong></p>

<p>Se conseguir conversar de forma a convenc&ecirc;-lo da import&acirc;ncia de estudar e participar juntamente com ele de seus estudos ser&aacute; mais eficiente do que amea&ccedil;as e castigos. Sem contar que algo mais importante que os estudos dele ir&aacute; acontecer, o relacionamento de voc&ecirc;s ser&aacute; algo mais desej&aacute;vel.</p>

<p><strong>Compre Livros Interessantes para Ele</strong></p>

<p>Pergunte e procure saber de que livros ele gosta e compre estes livros para um maior est&iacute;mulo &agrave; leitura.</p>

<p><strong>Nosso C&eacute;rebro</strong></p>

<p>O normal &eacute; que nosso c&eacute;rebro procure o prazer e fuja da dor, ou seja, procuramos praticar atividades agrad&aacute;veis e deixar de lado as desagrad&aacute;veis. Ent&atilde;o tanto voc&ecirc; pai precisa mostrar para seu filho que ele precisa gostar de estudar quanto seu filho precisa ter essa consci&ecirc;ncia. Se ele realmente entender que seu esfor&ccedil;o atual ser&aacute; compensado no futuro ele poder&aacute; se dedicar mais e seus estudos n&atilde;o ser&atilde;o um grande sacrif&iacute;cio.</p>

<p>Encontre formas de mostrar para seu c&eacute;rebro que o estudo &eacute; importante, necess&aacute;rio e pode ser agrad&aacute;vel, assim seu c&eacute;rebro o ajudar&aacute; nessa tarefa.</p>

<p><strong>Prioridades</strong></p>

<p>Na vida todos temos 24 horas no dia e podemos ter muito mais atividades para fazer no dia do que d&aacute; tempo, portanto precisamos escolher as mais importantes e focar nelas. Divida o seu dia em partes e procure se organizar para cumprir sua agenda. Lembre que estudar &eacute; muito importante para voc&ecirc; e deve dar prioridade sobre muitas outras atividades.</p>

<p><strong>O Poder da Visualiza&ccedil;&atilde;o</strong></p>

<p>Ajuda muito a memorizar uma tarefa se voc&ecirc; se visualizar fazendo. Para, relaxe, respire profunda e calmamente e comece a visualizar voc&ecirc; executando a atividade. Caso dramatize a mem&oacute;ria funciona melhor.</p>

<p>Tamb&eacute;m &eacute; importante que voc&ecirc; se visualize daqui h&aacute; alguns anos, caso n&atilde;o estude, como voc&ecirc; poder&aacute; ser e caso estude e se empenhe muito como poder&aacute; ser. O que acha?</p>

<p><strong>Encare primeiro o mais chato</strong></p>

<p>&Eacute; mais eficiente encarar primeiro as mat&eacute;rias mais &ldquo;chatas&rdquo;, aquelas em que tem mais dificuldade. Quando come&ccedil;ar a aprender e a dominar come&ccedil;ar&aacute; e deixar de achar chata e come&ccedil;ar&aacute; a gostar dela.</p>

<p><strong>Atitude</strong></p>

<p>Para ser bem sucedido nos estudos e chegar a gostar muito de estudara precisa se empenhar, caprichar no que faz e realmente assumir uma atitude de estudioso.</p>

<p>Essa atitude de seriedade deve se expandir para a sua vida como um todo, para a sua alimenta&ccedil;&atilde;o, sua sa&uacute;de em geral e seu estilo de vida. Afinal tudo isso o ajudar&aacute; a estudar e o ajudar&aacute; a viver melhor. Atitude, seriedade no sentido de combinar que far&aacute; algo e fazer e fazer bem feito, muto bem feito. Isso far&aacute; com que se sinta bem e te retornar&aacute; mais energia e confian&ccedil;a.</p>

<p><strong>Procrastina&ccedil;&atilde;o</strong></p>

<p>Para ser eficiente em alguma atividade precisamos nos cercar de alguns cuidados, ser disciplinados, organizados e de muito empenho. Algo que precisamos evitar a todo custo &eacute; a procrastina&ccedil;&atilde;o, aquela mania de deixar para fazer as coisas depois e acabamos nos esquecendo. Se tiver algo para fazer fa&ccedil;a agora e nunca deixe para depois. A hist&oacute;ria da atitude, da decis&atilde;o, da firmeza. Fa&ccedil;a disso um tra&ccedil;o da sua personalidade.</p>

<p><strong>Sa&uacute;de</strong></p>

<p>Esta &eacute; uma grande parceira dos seus estudos e da sua vida, portanto colabore com ela e se interesse em conhecer como cuidar dela. Boa alimenta&ccedil;&atilde;o, evitando produtos qu&iacute;micos em geral, dormir bem, profundamente, pelo menos 8 horas por noite, evite estresse, filmes e jogos violentos ou de terror, especialmente a noite antes de dormir. Cuida da sua sa&uacute;de, da sua vida.</p>

<p>&nbsp;</p>

