<!DOCTYPE HTML>
<!-- Visualize by TEMPLATED	templated.co @templatedco Released for free under the Creative Commons Attribution 3.0 license (templated.co/license) -->
<html>
	<head>
		<title>RibaFS - Que tal fazer uma parte?</title>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1" />

		<link rel="stylesheet" href="/assets/css/menu.css" />				
		<link rel="stylesheet" href="/assets/css/main.css" />
	</head>
<body>
<br>
<script src="/assets/js/jquery.min.js"></script>
<script>
   $(function(){
       $('#menu').load("./menu.html");
   });
</script>
<div id="menu"></div>
<!-- Final do Cabeçalho -->

<!-- Início do conteúdo-->
<meta charset="UTF-8" >
<style>
#conteudo{
	padding: 10px;
	font-family: 'Arial', Helvetica, sans-serif;
	margin: 0 auto;
	width: 800px;
	padding-bottom: 50px;
    background-color: #fff;
	color: #000;	
}
#rodape{
	margin-top: 400px;
}
</style>

<!-- Início de conteudo -->
<div id='conteudo'>
<h2 align="center" class="titulo">Que tal fazer uma parte?</h2>


<p>N&atilde;o &eacute; ainda fazer a sua parte, mas apenas fazer algo para mudar este quadro que est&aacute; a&iacute;. Me incomoda demais estar vivendo em meio a tudo isso e n&atilde;o fazer mais do que eu fa&ccedil;o.</p>

<p>Fico muito antenado para perceber e encontrar algo ou forma de colaborar e tentar melhorar nosso mundo. Quem sabe come&ccedil;ando a fazer um pouco n&oacute;s tomaos gosto e de fato fazemos tudo ao nosso alcance e procuramos o que nem esteja ao nosso alcance para reverter este quadro.</p>

<p>Fazendo uma pesquisa pelo Youtube para assistir um filme, o Youtube me sigere este (nos listados &agrave; direita), Primeiro fui ver alguns coment&aacute;rio, como gosto de fazer e me deparei com um que mereceu minha aten&ccedil;&atilde;o e estou divulgando aqui. Veja o que acha, independente se voc&ecirc; &eacute; crist&atilde;o ou n&atilde;o, como eu, talvez valha a pena, principalmente se voc&ecirc; acha que pode fazer mais do que faz hoje para mudar o mundo especialmente para os mais carentes disso.</p>

<p><a href="https://www.youtube.com/watch?v=0IaBhiIr8y4" target="_blank">https://www.youtube.com/watch?v=0IaBhiIr8y4</a></p>

<p>Citando fielmente um coment&aacute;rio. Adicionei apenas o &quot;e desconhecidos&quot;.</p>

<p>Hernandes Oliveira magr&atilde;o5 meses atr&aacute;s<br />
Quantas vezes queremos ajudar pessoas de outros continentes, e esquecemos daqueles que est&atilde;o ao nosso redor, pais, irm&atilde;os, filhos, esposa, esposo, amigos, conhecidos &quot;e desconhecidos&quot;. Vivemos somente para ganharmos dinheiro para ajuntarmos aquilo que n&atilde;o iremos levar, pois nem no inferno nem no c&eacute;u conseguimos comprar nada com as riquezas que se ajunta aqui. Deixe de comprar coca cola somente por um final semana por m&ecirc;s, e ent&atilde;o comprarmos lanches e levarmos para aqueles que por algum motivo n&atilde;o tem o que comer.</p>

<p>Obrigado!</p>

<p>Ribamar Fs<br />
Ribamar Fs 54 segundos atr&aacute;s (editado)<br />
Cara, voc&ecirc; puxou isso do cora&ccedil;&atilde;o. N&atilde;o acho que a economia da coca cola vai resolver nossos problemas, mas j&aacute; ajuda e desperta o princ&iacute;pio de sacrificar algo de n&oacute;s (nem &eacute; sacrif&iacute;cio, pois &eacute; sup&eacute;rfluo) em nome de quem est&aacute; precisando do fruto disso.<br />
Muito legal. Vou guardar isso com carinho.</p>

<p>&nbsp;</p>

