<!DOCTYPE HTML>
<!-- Visualize by TEMPLATED	templated.co @templatedco Released for free under the Creative Commons Attribution 3.0 license (templated.co/license) -->
<html>
	<head>
		<title>RibaFS - sua Vida Digital pode engolir sua vida Real</title>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1" />

		<link rel="stylesheet" href="/assets/css/menu.css" />				
		<link rel="stylesheet" href="/assets/css/main.css" />
	</head>
<body>
<br>
<script src="/assets/js/jquery.min.js"></script>
<script>
   $(function(){
       $('#menu').load("./menu.html");
   });
</script>
<div id="menu"></div>
<!-- Final do Cabeçalho -->

<!-- Início do conteúdo-->
<meta charset="UTF-8" >
<style>
#conteudo{
	padding: 10px;
	font-family: 'Arial', Helvetica, sans-serif;
	margin: 0 auto;
	width: 800px;
	padding-bottom: 50px;
    background-color: #fff;
	color: #000;	
}
#rodape{
	margin-top: 400px;
}
</style>

<!-- Início de conteudo -->
<div id='conteudo'>
<h2 align="center" class="titulo">Se liga: sua Vida Digital pode engolir sua vida Real</h2>

<p>A l&oacute;gica simples diz: &quot;Onde tem muita farofa &eacute; que tem pouca carne&quot;.<br />
Trazendo para c&aacute;: se a vida digital est&aacute; extremamente ativa &eacute; que a real est&aacute; uma merda.<br />
Por favor, reflita sobre o texto abaixo. Caso n&atilde;o seja o seu caso, passe para algu&eacute;m que passa por isso. Adaptei de um v&iacute;deo que recebi.<br />
Como em qualquer mensagem, nem tudo tem fundamento mas me parece que muita coisa &eacute; &uacute;til.</p>

<p><br />
&nbsp;</p>

<p><img src="vidadigital.jpg" alt="vidadigital"></p>

<p>[imagem]<br />
Eu tenho 422 amigos, mas estou s&oacute;.<br />
Eu j&aacute; falei com todos eles algum dia, mas nenhum deles me conhece de verdade.<br />
O problema que eu tenho &eacute; que eu n&atilde;o posso olhar nos olhos deles, s&oacute; vejo o nome deles na tela.<br />
<br />
Fa&ccedil;o uma pausa e olho ao redor, percebo que esta rede &agrave; que chamamos &quot;social&quot; &eacute; tudo menos social...<br />
<br />
Quando abrirmos nossos computadores, &eacute; nossas portas que estamos fechando.<br />
Toda essa tecnolog&iacute;a que possuimos, &eacute; s&oacute; uma ilus&atilde;o.<br />
Comunidade, companhia, um sentido de inclus&atilde;o digital...<br />
<br />
Quando voc&ecirc; se afasta desse aparelho de ilus&atilde;o, voc&ecirc; acorda e v&ecirc; um mundo confuso.<br />
Um mundo onde somos escravos da tecnologia que criamos.<br />
Onde a informa&ccedil;&atilde;o, as nossas informa&ccedil;&otilde;es s&atilde;o vendidas, por grandes e inescrupulosas empresa.<br />
<br />
Um mundo de interesses, emo&ccedil;&otilde;es e imagens individualistas.<br />
Onde compartilhamos nossos melhores arquivos, nossas informa&ccedil;&otilde;es, mas deixamos de lado nossas emo&ccedil;&otilde;es. E nossas informa&ccedil;&otilde;es enriquecem Facebook, Google e outros.<br />
<br />
Ficamos felizes quando compartilhamos as experi&ecirc;ncias, mas estas experi&ecirc;ncias, n&atilde;o s&atilde;o quase nada sem algu&eacute;m do nosso lado (mas aqui mesmo, de forma real)!<br />
Estar a&iacute; ao lado dos seus amigos, podendo apertar a m&atilde;o deles, abra&ccedil;ar e perceber as suas emo&ccedil;&otilde;es mesmo que ele fale ou n&atilde;o fale, isso sim que &eacute; estar no presente.<br />
Mas ningu&eacute;m est&aacute; atualemnte vivendo o momento presente, pois achamos suficiente uma mensagem que recebemos dos amigos virtuais.<br />
<br />
N&oacute;s editamos, n&oacute;s exageramos, n&oacute;s criamos &quot;relacionamentos&quot;. Mas pretendemos n&atilde;o perceber o isolamento social. Tudo isso porque a nossa vida real, l&aacute; fora n&atilde;o nos oferece a motiva&ccedil;&atilde;o que esta virtual est&aacute; oferecendo.<br />
<br />
N&oacute;s pomos as palavras na ordem que desejamos para ficarem bonitas, mas na verdade nem sabemos se algu&eacute;m vai l&ecirc;-las e geralmente nem l&ecirc;, pois recebemos poucas curtidas, &quot;cutucadas&quot; (ainda bem que estas morreram), coment&aacute;rios e compartilhamentos.<br />
<br />
Estar s&oacute; n&atilde;o &eacute; o problema, enfatizo. Quando lemos um livro, desenhamos, ou fazemos algum exerc&iacute;cio, estamos presentes no momento e sendo produtivos, n&atilde;o reservados, nem reclusos (ser&aacute; mesmo? Porque ent&atilde;o gente extremamente produtiva nunca leu nem escreveu nada. Conhece algu&eacute;m que nunca escreveu uma linha? S&oacute; analfabetos? Pense mais um pouco pois conhe&ccedil;o um que foi o que mais influenciou a maneira de pensar de todos os seres humanos e nunca escreveu, conhece?).<br />
<br />
Ent&atilde;o, quando voc&ecirc; estiver ao p&uacute;blico, e come&ccedil;ar a se sentir sozinho, tire as m&atilde;os do seu celular, voc&ecirc; n&atilde;o precisa namorar sua lista de contatos, fale com o outro que est&aacute; ao seu lado, se pergunte porque sua vida real est&aacute; t&atilde;o desmotivada que te empurra para o Facebook, ser&aacute; que n&atilde;o &eacute; importante para voc&ecirc; e para os seus que procure ver o que est&aacute; erado? Aprenda a viver com os outros e a suportar tamb&eacute;m seus problemas. J&aacute; refletiu porque tanta gente atualmente adota cachorros e gatos ao inv&eacute;s de crian&ccedil;as? Um chute: ser&aacute; que elas conseguem aguentar elas pr&oacute;prias? Ser&aacute; que conseguem se relacionar com gente de verdade? Parece que n&atilde;o, os bichinhos s&atilde;o realmente de mais f&aacute;cil trato e &eacute; at&eacute; melhor que seja assim mesmo e aqui n&atilde;o fica cr&iacute;tica, mas compreens&atilde;o para estas pessoas. Que voc&ecirc; possa sensibilizar uma pessoa destas para que ela possa primeiro conviver bem consimo mesmo e depois, quem sabe, com outros seres humanos e n&atilde;o precisa abandonar os bichinhos mas tem tanta crian&ccedil;a precisando de carinho e sem um lar e nem pais!!!!!<br />
<br />
N&atilde;o aguento escutar o silencio completo do &ocirc;nibus lotado, pois ningu&eacute;m fala com ningu&eacute;m, cada um na sua. Quem est&aacute; sentado l&ecirc; (raros), usa seu celular ou n&atilde;o faz nada, mas sem conversa... E nossos visinhos, n&oacute;s conhecemos, falamos com eles? E nossos familiares, n&oacute;s nos encontramos realmente com eles, conversamos com eles, vamos &agrave;s suas casas, aqueles que n&atilde;o moram conosco. Pior ainda, e na nossa casa como &eacute; cada um no seu celular, no seu conputador, na sua TV, ou voc&ecirc;s est&atilde;o sentados na sala um ao lado do outro conversando, falando de como foi seu dia, trocando experi&ecirc;ncias, ensinando as coisas boas que aprenderam, e alertando para as ruins?<br />
<br />
Voc&ecirc; j&aacute; se reuniu com eles, os &quot;seus&quot; e numa reuni&atilde;o acalorada, o calor humano era tanto que voc&ecirc; os fez chorar, mas n&atilde;o porque voc&ecirc; bateu, humilhou ou os aterrorizou, n&atilde;o, mas porque tocou seus cora&ccedil;&otilde;es com suas palavras bonitas e cheias de amor, os emocionou tanto com os seus pr&oacute;prios, j&aacute;? Voc&ecirc; acreditaria se eu te dissesse que eu j&aacute;? Pois eu j&aacute;!<br />
<br />
Estamos virando anti-sociais,&nbsp; perdendo a capacidade de nos comprometer pelo outro,<br />
de escutar o outro e ver ele aos olhos, olhando de fato com carinho e interesse.<br />
Estamos rodeados de crian&ccedil;as que desde que nasceram, vivem igual rob&ocirc;s e acham que &eacute; essa a norma, pois n&oacute;s tamb&eacute;m somos assim e as ensinamos.<br />
Com meus amigos com filhos, vejo que &eacute; quase imposs&iacute;vel entreter uma crian&ccedil;a...<br />
se n&atilde;o usar um ipad....<br />
<br />
Quando eu era crian&ccedil;a, eu nunca estava em casa, andava de bicicleta, com os amigos, parentes, ou estava em cima das &aacute;rvores.<br />
Agora os parques est&atilde;o mais calados, e eu tamb&eacute;m, n&atilde;o tem mais bicicletas e os balan&ccedil;os est&atilde;o sem balan&ccedil;ar.<br />
Somos uma gera&ccedil;&atilde;o de idiotas: smartphones e gente boba.<br />
<br />
Olhe um poquinho acima do seu telefone e desligue a tela. Olhe ao redor, procure tornar seu dia de hoje, o melhor poss&iacute;vel.<br />
<br />
Uma verdadeira conex&atilde;o, uma s&oacute;, poderia te levar a enxergar a diferen&ccedil;a que o &quot;estar presente&quot; pode fazer.<br />
<br />
Estar no presente, no mundo real, enquanto ela te olha nos olhos, com essa mirada que voc&ecirc; lembrar&aacute; para sempre.<br />
<br />
Como quando o amor bate... os sorrisos, os beijos, as brigas e coisas chatas tamb&eacute;m, diferente do Facebook, onde s&oacute; vemos frases bonitas e perfeitas.<br />
<br />
Voc&ecirc; n&atilde;o tem que compartilhar publicamente tudo o que faz, pois &eacute; s&oacute; com ela, com quem quer verdadeiramente ESTAR...<br />
<br />
O momento em que chega a vender o seu computador para poder comprar um anel para a mulher de seus sonhos, este &eacute; que &eacute; o momento real...<br />
O momento em que voc&ecirc; quer come&ccedil;ar uma fam&iacute;lia....<br />
O momento em que voc&ecirc; segura sua primeira filha e se apaixona de novo,<br />
O momento em que ela te acorda quando a &uacute;nica coisa que voc&ecirc; quer &eacute; descansar,<br />
O momento quando voc&ecirc; enxuga as lagrimas quando sua beb&ecirc; voa do ninho (casou),<br />
O momento em que sua filha volta com seu neto para voc&ecirc; abra&ccedil;ar,<br />
O momento em que te chama vov&ocirc; e te faz sentir velho mas importante,<br />
<br />
O momento em que voc&ecirc; olha para atr&aacute;s e fica feliz de ter estado no momento, de n&atilde;o ter jogado fora o tempo da sua vida olhando pra abaixo para baixo (celular) ou para a frente (computador) atrav&eacute;s de uma inven&ccedil;&atilde;o humana.<br />
<br />
O momento em que voc&ecirc; segura a m&atilde;o da sua esposa sentado do lado da cama, fala um te amo, lhe beija a testa,<br />
<br />
O momento em que ela responde que foi afortunada de ter sido abordada na rua por um estranho te perguntando um endere&ccedil;o...<br />
<br />
Mas isso tudo n&atilde;o aconteceu ainda, voc&ecirc; ainda n&atilde;o tem nada disso e talvez nunca tenha,<br />
pois quando voc&ecirc; est&aacute; no Facebook, no Whatsap, Instagram, etc, voc&ecirc; n&atilde;o olha para todas as oportunidades que voc&ecirc; poderia olhar.<br />
<br />
Ent&atilde;o, tire os olhos do seu celular, do seu computador, olhe para os lados, temos um certo numero fixo de dias de vida e somente eles, n&atilde;o podemos voltar o tempo. N&atilde;o se deixe absorver inteirametne pela net, pois quando o fim se aproxima, n&atilde;o tem nada pior que o arrependimento.<br />
<br />
Eu tamb&eacute;m sou culpado disso, por ser um post neste aparelho, neste mundo retorcido, onde somos talvez ouvidos, mas nunca vistos e nem tocados de verdade.<br />
<br />
Em lugar de falar, usamos o teclado, em lugar de ler, chateamos, e passamos horas juntos, sem n&oacute;s olhar. Talvez voc&ecirc; esteja em casa, com toda sua fam&iacute;lia, mas cada um em seu celular, computador ou TV. T&aacute; legal, isso? Tudo isso &eacute; bom, mas e a nossa vida?<br />
<br />
N&atilde;o viva uma vida seguindo s&oacute; a onda, n&atilde;o d&ecirc; s&oacute; sua curtida &agrave; pessoa que voc&ecirc; adora.<br />
<br />
Desconecte-se da rede, seja ouvido, percebido, olhe ao seu lado, seus pais, seus filhos, sua esposa, esposo, v&aacute; l&aacute; fora, para o mundo, t&aacute; cheio de gente real, com hist&oacute;rias reais precisando muitas vezes de uma palavra, apoio, carinho, uma ajuda qualquer que voc&ecirc; est&aacute; se negando a dar.<br />
<br />
Olhe por cima do seu telefone, desliga a tela.<br />
<br />
Pare de olhar esse v&iacute;deo ou este texto e v&aacute; viver a vida real, mas viva intensamente, viva com abund&acirc;ncia.<br />
<br />
Estes s&atilde;o meus mais sinceros votos, do fundo do cora&ccedil;&atilde;o!<br />
<br />
Traduzido por : <a href="http://www.yogui.co/">http://www.yogui.co</a>&nbsp;<br />
Visite nossa p&aacute;gina !<br />
<br />
Altera&ccedil;&otilde;es/corre&ccedil;&otilde;es livres de Ribamar FS - <a href="http://ribafs.org/">http://ribafs.org</a></p>

<p>&nbsp;</p>

