<!DOCTYPE HTML>
<!-- Visualize by TEMPLATED	templated.co @templatedco Released for free under the Creative Commons Attribution 3.0 license (templated.co/license) -->
<html>
	<head>
		<title>RibaFS - Uma Grande Li&ccedil;&atilde;o de Vida</title>
		<meta charset="utf-8" />
		<meta name="viewport" content="width=device-width, initial-scale=1" />

		<link rel="stylesheet" href="/assets/css/menu.css" />				
		<link rel="stylesheet" href="/assets/css/main.css" />
	</head>
<body>
<br>
<script src="/assets/js/jquery.min.js"></script>
<script>
   $(function(){
       $('#menu').load("./menu.html");
   });
</script>
<div id="menu"></div>
<!-- Final do Cabeçalho -->

<!-- Início do conteúdo-->
<meta charset="UTF-8" >
<style>
#conteudo{
	padding: 10px;
	font-family: 'Arial', Helvetica, sans-serif;
	margin: 0 auto;
	width: 800px;
	padding-bottom: 50px;
    background-color: #fff;
	color: #000;	
}
#rodape{
	margin-top: 400px;
}
</style>

<!-- Início de conteudo -->
<div id='conteudo'>
<h2 align="center" class="titulo">Uma Grande Li&ccedil;&atilde;o de Vida</h2>

<p>Uma senhora idosa, elegante, bem vestida e penteada, estava de mudan&ccedil;a para uma casa de repouso pois o marido com quem vivera 70 anos, havia morrido e ela ficara s&oacute;&hellip;</p>

<p>Depois de esperar pacientemente por duas horas na sala de visitas, ela ainda deu um lindo sorriso quando uma atendente veio dizer que seu quarto estava pronto.</p>

<p>A caminho de sua nova morada, a atendente ia descrevendo o min&uacute;sculo quartinho, inclusive as cortinas de chintz florido que enfeitavam a janela.</p>

<p>- Ah, eu adoro essas cortinas &ndash; disse ela com o entusiasmo de uma garotinha que acabou de ganhar um filhote de cachorrinho.</p>

<p>- Mas a senhora ainda nem viu seu quarto&hellip;</p>

<p>- Nem preciso ver &ndash; respondeu ela. &ndash; Felicidade &eacute; algo que voc&ecirc; decide por princ&iacute;pio. E eu j&aacute; decidi que vou adorar! &Eacute; uma decis&atilde;o que tomo todo dia quando acordo. Sabe, eu tenho duas escolhas: Posso passar o dia inteiro na cama contando as dificuldades que tenho em certas partes do meu corpo que n&atilde;o funcionam bem&hellip; ou posso levantar da cama agradecendo pelas outras partes que ainda me obedecem. Cada dia &eacute; um presente. E enquanto meus olhos abrirem, vou focaliza-los no novo dia e tamb&eacute;m nas boas lembran&ccedil;as que eu guardei para esta &eacute;poca da vida. A velhice &eacute; como uma conta banc&aacute;ria: Voc&ecirc; s&oacute; retira daquilo que voc&ecirc; guardou. Portanto, lhe aconselho depositar um monte de alegria e felicidade na sua Conta de Lembran&ccedil;as. E como voc&ecirc; v&ecirc;, eu ainda continuo depositando. Agora, se me permite, gostaria de lhe dar uma receita:</p>

<p>1- Jogue fora todos os n&uacute;meros n&atilde;o essenciais para sua sobreviv&ecirc;ncia.</p>

<p>2- Continue aprendendo. Aprenda mais sobre computador, artesanato, jardinagem, qualquer coisa. N&atilde;o deixe seu c&eacute;rebro desocupado.</p>

<p>3- Curta coisas simples.</p>

<p>4- Ria sempre, muito e alto. Ria at&eacute; perder o f&ocirc;lego.</p>

<p>5- L&aacute;grimas acontecem. Aguente, sofra e siga em frente. A &uacute;nica pessoa que acompanha voc&ecirc; a vida toda &eacute; VOC&Ecirc; mesmo. Esteja VIVO, enquanto voc&ecirc; viver.</p>

<p>6- Esteja sempre rodeado daquilo que voc&ecirc; gosta: pode ser fam&iacute;lia, animais , lembran&ccedil;as, m&uacute;sica, plantas, um hobby, o que for. Seu lar &eacute; o seu ref&uacute;gio.</p>

<p>7- Aproveite sua sa&uacute;de. Se for boa, preserve-a. Se est&aacute; inst&aacute;vel, melhore-a. Se est&aacute; abaixo desse n&iacute;vel, pe&ccedil;a ajuda.</p>

<p>8- Diga a quem voc&ecirc; ama, que voc&ecirc; realmente o ama, em todas as oportunidades.</p>

<p>E LEMBRE-SE SEMPRE QUE:</p>

<p>A vida n&atilde;o &eacute; medida pelo n&uacute;mero de vezes que voc&ecirc; respirou, mas pelos momentos em que voc&ecirc; perdeu o f&ocirc;lego &hellip;</p>

<p>de tanto rir &hellip;</p>

<p>de surpresa &hellip;</p>

<p>de &ecirc;xtase &hellip;</p>

<p>de felicidade!</p>

<p>Simples assim!!!</p>

<p>Autor desconhecido</p>

<p>&nbsp;</p>

